# Core CLI tools
brew "zsh"
brew "tmux"
brew "neovim"
brew "neomutt"
brew "git"
brew "git-lfs"
brew "gnupg"

# Modern CLI replacements
brew "eza"          # ls replacement
brew "bat"          # cat replacement
brew "ripgrep"      # grep replacement
brew "fd"           # find replacement
brew "dust"         # du replacement
brew "procs"        # ps replacement
brew "btop"         # top replacement
brew "duf"          # df replacement
brew "delta"        # git diff pager

# Shell enhancements
brew "fzf"
brew "zoxide"       # smarter cd
brew "direnv"       # directory-specific env
brew "atuin"        # shell history
brew "fastfetch"    # system info splash
brew "mise"         # universal version manager

# Languages & package managers
brew "go"
brew "python@3"
brew "uv"           # Python package manager
brew "node"
brew "pnpm"         # Node package manager

# Dev tools
brew "lazygit"
brew "gh"           # GitHub CLI
brew "jq"           # JSON processor
brew "yq"           # YAML processor
brew "fx"           # interactive JSON viewer
brew "glow"         # Markdown renderer
brew "tokei"        # Code stats
brew "shellcheck"   # Shell linter

# Container & K8s
brew "kubectl"
brew "k9s"
brew "helm"

# Infrastructure
brew "terraform"

# Optional / fun
brew "figlet"
brew "lolcat"
brew "fortune"
brew "cowsay"

# Fonts
cask "font-meslo-lg-nerd-font"

# Casks
cask "docker"
cask "iterm2"
cask "raycast"
cask "rectangle"
cask "1password"

# Optional casks (uncomment as needed)
# cask "cursor"
# cask "tableplus"
# cask "insomnia"
# cask "linear-linear"
